In [1]:
import pandas as pd
pd.read_table('http://bit.ly/movieusers')

          1|24|M|technician|85711
0              2|53|F|other|94043
1             3|23|M|writer|32067
2         4|24|M|technician|43537
3              5|33|F|other|15213
4          6|42|M|executive|98101
..                            ...
937        939|26|F|student|33319
938  940|32|M|administrator|02215
939        941|20|M|student|97229
940      942|48|F|librarian|78209
941        943|22|M|student|77841

[942 rows x 1 columns]

In [20]:
user_cols=['User_id','Age','Gender','Occupation','Zip_code']
users=pd.read_table('http://bit.ly/movieusers',sep="|",header=None,names=user_cols,index_col='User_id')

In [21]:
users.Zip_code.duplicated()

User_id
1      False
2      False
3      False
4      False
5      False
       ...
939    False
940     True
941    False
942    False
943    False
Name: Zip_code, Length: 943, dtype: bool

In [22]:
users.Zip_code.duplicated().sum()

148

In [23]:
users.duplicated()

User_id
1      False
2      False
3      False
4      False
5      False
       ...
939    False
940    False
941    False
942    False
943    False
Length: 943, dtype: bool

In [24]:
users.duplicated().sum()

7

In [28]:
users.loc[users.duplicated(keep='first'),:]

         Age Gender Occupation Zip_code
User_id
496       21      F    student    55414
572       51      M   educator    20003
621       17      M    student    60402
684       28      M    student    55414
733       44      F      other    60630
805       27      F      other    20009
890       32      M    student    97301

In [29]:
users.loc[users.duplicated(keep=False),:]

         Age Gender Occupation Zip_code
User_id
67        17      M    student    60402
85        51      M   educator    20003
198       21      F    student    55414
350       32      M    student    97301
428       28      M    student    55414
437       27      F      other    20009
460       44      F      other    60630
496       21      F    student    55414
572       51      M   educator    20003
621       17      M    student    60402
684       28      M    student    55414
733       44      F      other    60630
805       27      F      other    20009
890       32      M    student    97301

In [30]:
users.drop_duplicates(keep='last').shape

(936, 4)

In [31]:
users.drop_duplicates(keep=False).shape

(929, 4)

In [32]:
users.shape

(943, 4)

In [34]:
users.duplicated(subset=['Age','Occupation']).sum()

514